tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"
tap "homebrew/services"
tap "rs/tap"

# A better ps
brew "procs"

# GNU core utilities (those that come with macOS are outdated)
brew "coreutils"
brew "moreutils"

# GNU `find`, `locate`, `updatedb`, and `xargs`, `g`-prefixed
brew "findutils"

# GNU `sed`, overwriting the built-in `sed`
# Update -- https://discourse.brew.sh/t/why-was-with-default-names-removed/4405/8 -- overwriting no longer valid
brew "gnu-sed"

# A better to curl
brew "curlie"
brew "wget"

# homebrew version of curl did not work downloading certain files. Investigating...
brew "curl"

# A password manager
brew "pass"

# The hot replacement for npm
brew "yarn"

# Neovim -- a better Vim
brew "neovim"
brew "pyenv"

# Better than Apple versions
brew "grep"
brew "openssh"
brew "openssl"

# z hopping around folders
brew "z"

# Simple, fast and user-friendly alternative to find
brew "fd"

# Alternative to the grep command - much faster one, with sane defaults and colorized output.
brew "ripgrep"

# github util. gotta love `hub fork`, `hub create`, `hub checkout <PRurl>`
brew "git"
brew "git-extras"
brew "tree"

# delete safely
brew "safe-rm"

# shells
brew "bash"
brew "bash-completion"

brew "zsh"
brew "zsh-autosuggestions"
brew "zsh-completions"
brew "zsh-syntax-highlighting"

# colorize the world
brew "grc"

# A better cat
brew "bat"

# JSON searching
brew "jq"

# Fuzzy finding
brew "fzf"

# Network utility
brew "netcat"

# A better `ls`
brew "exa"

# A beter man pages
brew "tldr"

# View markdown in the terminal
brew "glow"

# quicklook hotness
cask "qlcolorcode"
cask "qlstephen"
cask "qlmarkdown"
cask "quicklook-json"

# Screen recording software
cask "kap"
